{"keras_version": "1.2.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"stateful": false, "go_backwards": false, "U_regularizer": null, "return_sequences": false, "activation": "tanh", "output_dim": 4, "inner_activation": "hard_sigmoid", "W_regularizer": null, "unroll": false, "trainable": true, "b_regularizer": null, "inner_init": "orthogonal", "input_length": null, "input_dim": 1, "forget_bias_init": "one", "batch_input_shape": [null, 1, 1], "dropout_U": 0.0, "input_dtype": "float32", "dropout_W": 0.0, "name": "lstm_1", "init": "glorot_uniform", "consume_less": "cpu"}}, {"class_name": "Dense", "config": {"activation": "linear", "output_dim": 1, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "b_constraint": null, "bias": true, "b_regularizer": null, "W_constraint": null, "name": "dense_1", "input_dim": 4}}]}